modules/Tour/Controllers/TourController.php

        public function index(Request $request)
        {
            $is_ajax = $request->query('_ajax');

            if(!empty($request->query('limit'))){
                $limit = $request->query('limit');
            }else{
                $limit = !empty(setting_item("tour_page_limit_item"))? setting_item("tour_page_limit_item") : 9;
            }
            $query = $this->tourClass->search($request->input());
            $travelLocation = $this->travelLocation::where('location_id',Request('location_id'))->get('tour_id')->toArray();
---
select `tour_id` from `travel_locations` where `location_id` is null

            }
            $data = [
                'rows' => $list,
                'tour_category' => $this->tourCategoryClass::where('status', 'publish')->with(['translation'])->get()->toTree(),
---
select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null