modules/User/Controllers/Auth/RegisterController.php

insert into `users` (`first_name`, `birthday`, `country`, `last_name`, `email`, `password`, `status`, `phone`, `name`, `updated_at`, `created_at`) values ('asdasdasd', '2023-10-16', 'EG', 'Hatem', 'ads@gmail.com', '$2y$10$3UOpn/YldM8EotWjVUqGQecROhtgoMKDG5O1lYT3GO2vTjGW3WyOm', 'publish', '1232131231', 'asdasdasd Hatem', '2023-10-29 16:01:34', '2023-10-29 16:01:34')
---
                ], 200);
            } else {

                $user = \App\User::create([
                    'first_name' => $request->input('first_name'),
                    'birthday' => $request->input('birthday'),
                    'country' => $request->input('country'),
                    'last_name'  => $request->input('last_name'),
                    'email'      => $request->input('email'),
                    'password'   => Hash::make($request->input('password')),
                    'status'    => $request->input('publish','publish'),
                    'phone'    => $request->input('key').$request->input('phone'),
                ]);